# IsMiterLocked Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExtension..::..IsMiterLocked Property
IExtension Interface See Also
---
Retrieves or set the miter locked status at the end.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
bool this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Property IsMiterLocked ( _
	index As Integer _
) As Boolean
	Get
	Set
```

Visual C++
---
```text
property bool IsMiterLocked[int index] {
	bool get (int index);
	void set (int index, bool value);
}
```

# ### Parameters
index
    Type: System..::..Int32
# Remarks
Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown. For beams, only if the beam is extended and is mitered with other beams at the end, it can be locked. Otherwise, the setting is invalid
# See Also
IExtension Interface
Autodesk.Revit.DB Namespace